src/cf/src/InformationRegisters/КурсыВалют/КурсыВалют.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КурсыВалют</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Курс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/cf/src/CommonModules/РаботаСВалютами/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Документы в валюте: курсы из регистра КурсыВалют, валюта и курс документа или объекта
// расчётов, пересчёт цен видов цен в валюту документа.
//
// Курс - сколько единиц основной валюты (константа ВалютаРегламентированногоУчета) стоит
// одна единица валюты. Суммы регистров взаиморасчётов, товаров и продаж - в основной валюте.
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Основная валюта учёта.
//
// Возвращаемое значение:
//  СправочникСсылка.Валюты - значение константы ВалютаРегламентированногоУчета.
//
Функция ОсновнаяВалюта() Экспорт
	Возврат Константы.ВалютаРегламентированногоУчета.Получить();
КонецФункции

// Курс валюты на дату из регистра КурсыВалют.
//
// Параметры:
//  Валюта - СправочникСсылка.Валюты - валюта; пустая - основная.
//  Дата - Дата - дата курса.
//
// Возвращаемое значение:
//  Число - курс; для основной валюты 1; курс не задан - 0.
//
Функция КурсВалюты(Валюта, Дата) Экспорт
	Если Не ЗначениеЗаполнено(Валюта) Или Валюта = ОсновнаяВалюта() Тогда
		Возврат 1;
	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КурсыВалютСрезПоследних.Курс КАК Курс
	|ИЗ
	|	РегистрСведений.КурсыВалют.СрезПоследних(&Дата, Валюта = &Валюта) КАК КурсыВалютСрезПоследних";
	Запрос.УстановитьПараметр("Дата", ?(ЗначениеЗаполнено(Дата), КонецДня(Дата), ТекущаяДатаСеанса()));
	Запрос.УстановитьПараметр("Валюта", Валюта);
	Выборка = Запрос.Выполнить().Выбрать();
	Возврат ?(Выборка.Следующий(), Выборка.Курс, 0);
КонецФункции

// Валюта и курс документа. Документ в валюте - только с установленным флажком ВВалюте (у документов
// без флажка, например возврата поставщику, - с валютой, отличной от основной). Пустая валюта или
// нулевой курс читаются как основная валюта и курс 1.
//
// Параметры:
//  ДокОбъект - ДокументОбъект, ДанныеФормыСтруктура, Структура - документ с реквизитами Валюта,
//              КурсВалюты и, возможно, ВВалюте; без реквизита Валюта документ считается в основной.
//
// Возвращаемое значение:
//  Структура - Валюта (СправочникСсылка.Валюты), Курс (Число), ВВалюте (Булево).
//
Функция ВалютаИКурсДокумента(ДокОбъект) Экспорт
	Если ТипЗнч(ДокОбъект) = Тип("ДокументОбъект.ПоступлениеДополнительныхРасходов") Тогда
		Возврат ВалютаИКурсПоРеквизитам(Неопределено, 1, Неопределено); // см. ВалютаИКурсОбъекта
	КонецЕсли;
	ЕстьВалюта = РаботаСДокументамиКлиентСервер.ЕстьРеквизит(ДокОбъект, "Валюта");
	ЕстьФлажок = РаботаСДокументамиКлиентСервер.ЕстьРеквизит(ДокОбъект, "ВВалюте");
	Возврат ВалютаИКурсПоРеквизитам(
		?(ЕстьВалюта, ДокОбъект.Валюта, Неопределено),
		?(ЕстьВалюта, ДокОбъект.КурсВалюты, 1),
		?(ЕстьФлажок, ДокОбъект.ВВалюте, Неопределено));
КонецФункции

// Валюта и курс объекта расчётов (документа-ссылки) - по тем же правилам, что ВалютаИКурсДокумента.
// Вызывается из проведения (привилегированный режим документа) и из форм и печати документа, к которому
// у пользователя есть доступ.
//
// Параметры:
//  Объект - ЛюбаяСсылка, Неопределено - объект расчётов движения взаиморасчётов или документ-основание.
//
// Возвращаемое значение:
//  Структура - Валюта, Курс, ВВалюте (см. ВалютаИКурсДокумента).
//
Функция ВалютаИКурсОбъекта(Объект) Экспорт
	Если Не ЗначениеЗаполнено(Объект) Или Не ОбщегоНазначения.ЭтоСсылка(ТипЗнч(Объект)) Тогда
		Возврат ВалютаИКурсПоРеквизитам(Неопределено, 1, Неопределено);
	КонецЕсли;
	МетаданныеОбъекта = Объект.Метаданные();
	Реквизиты = МетаданныеОбъекта.Реквизиты;
	// Поступление доп. расходов валюту и курс хранит, но проводится в основной валюте: валютным не считается.
	Если Реквизиты.Найти("Валюта") = Неопределено Или Реквизиты.Найти("КурсВалюты") = Неопределено
		Или МетаданныеОбъекта = Метаданные.Документы.ПоступлениеДополнительныхРасходов Тогда
		Возврат ВалютаИКурсПоРеквизитам(Неопределено, 1, Неопределено);
	КонецЕсли;
	ЕстьФлажок = Реквизиты.Найти("ВВалюте") <> Неопределено;
	ИменаРеквизитов = "Валюта, КурсВалюты" + ?(ЕстьФлажок, ", ВВалюте", "");
	Значения = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект, ИменаРеквизитов);
	Возврат ВалютаИКурсПоРеквизитам(Значения.Валюта, Значения.КурсВалюты,
		?(ЕстьФлажок, Значения.ВВалюте, Неопределено));
КонецФункции

// Цена вида цен в валюте документа: Цена × Курс(валюты цены) / Курс документа.
//
// Параметры:
//  Цена - Число - цена в валюте цены.
//  ВалютаЦены - СправочникСсылка.Валюты - валюта цены; пустая - основная.
//  ВалютаДокумента - СправочникСсылка.Валюты - валюта документа; пустая - основная.
//  КурсДокумента - Число - курс валюты документа (для основной - 1).
//  Дата - Дата - дата курса валюты цены.
//  КурсНайден - Булево - возврат: Ложь, если курс валюты цены на дату не задан и цена не пересчитана.
//
// Возвращаемое значение:
//  Число - цена в валюте документа.
//
Функция ПересчитатьЦену(Цена, ВалютаЦены, ВалютаДокумента, КурсДокумента, Дата, КурсНайден = Истина) Экспорт
	КурсНайден = Истина;
	Основная = ОсновнаяВалюта();
	ИзВалюты = ?(ЗначениеЗаполнено(ВалютаЦены), ВалютаЦены, Основная);
	ВВалюту = ?(ЗначениеЗаполнено(ВалютаДокумента), ВалютаДокумента, Основная);
	Если Цена = 0 Или ИзВалюты = ВВалюту Тогда
		Возврат Цена;
	КонецЕсли;
	КурсЦены = КурсВалюты(ИзВалюты, Дата);
	Если КурсЦены = 0 Тогда
		КурсНайден = Ложь;
		Возврат Цена;
	КонецЕсли;
	Курс = ?(ВВалюту = Основная Или КурсДокумента <= 0, 1, КурсДокумента);
	Возврат Цена * КурсЦены / Курс;
КонецФункции

// Приводит валюту документа к флажку ВВалюте перед записью: флажок снят или валюта основная - основная
// валюта и курс 1; флажок установлен без курса - курс на дату документа из регистра, а нет его - отказ:
// документ по курсу 1 провёл бы суммы в валюте как основные.
//
// Параметры:
//  ДокОбъект - ДокументОбъект - документ с реквизитами ВВалюте, Валюта, КурсВалюты, Дата.
//  Отказ - Булево - устанавливается, если курс документа в валюте не задан.
//
Процедура ПроверитьВалютуДокумента(ДокОбъект, Отказ = Ложь) Экспорт
	Основная = ОсновнаяВалюта();
	Если ДокОбъект.ВВалюте И ЗначениеЗаполнено(ДокОбъект.Валюта) И ДокОбъект.Валюта <> Основная Тогда
		Если ДокОбъект.КурсВалюты <= 0 Тогда
			ДокОбъект.КурсВалюты = КурсВалюты(ДокОбъект.Валюта, ДокОбъект.Дата);
		КонецЕсли;
		Если ДокОбъект.КурсВалюты <= 0 Тогда
			Шаблон = НСтр("ru = 'Не указан курс валюты %1.'; fr = 'Le taux de change de %1 n''est pas indiqué.';
				|en = 'The %1 exchange rate is not specified.'; es = 'No se indica el tipo de cambio de %1.'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон(Шаблон, ДокОбъект.Валюта), ДокОбъект,
				"КурсВалюты", , Отказ);
		КонецЕсли;
		Возврат;
	КонецЕсли;
	ДокОбъект.ВВалюте = Ложь;
	ДокОбъект.Валюта = Основная;
	ДокОбъект.КурсВалюты = 1;
КонецПроцедуры

// Переносит валюту и курс с документа-основания в документ, вводимый на основании.
//
// Параметры:
//  ДокОбъект - ДокументОбъект - заполняемый документ с реквизитами ВВалюте, Валюта, КурсВалюты.
//  Основание - ДокументСсылка - основание; без валюты документ остаётся в основной валюте.
//
Процедура ЗаполнитьВалютуПоОснованию(ДокОбъект, Основание) Экспорт
	ВалютаОснования = ВалютаИКурсОбъекта(Основание);
	ДокОбъект.ВВалюте = ВалютаОснования.ВВалюте;
	ДокОбъект.Валюта = ВалютаОснования.Валюта;
	ДокОбъект.КурсВалюты = ВалютаОснования.Курс;
КонецПроцедуры

// Сумма документа-основания в основной валюте - для оплаты, вводимой на его основании.
//
// Параметры:
//  Основание - ДокументСсылка - документ с валютой или без неё.
//  Сумма - Число - сумма основания в его валюте.
//
// Возвращаемое значение:
//  Число - сумма в основной валюте.
//
Функция СуммаОбъектаВОсновнойВалюте(Основание, Сумма) Экспорт
	Возврат РаботаСВалютамиКлиентСервер.СуммаРегл(Сумма, ВалютаИКурсОбъекта(Основание).Курс);
КонецФункции

// Пересчитывает колонки сумм таблицы из валюты документа в основную валюту (с округлением до копеек).
//
// Параметры:
//  Таблица - ТаблицаЗначений - строки документа.
//  Курс - Число - курс валюты документа; 1 - без пересчёта.
//  ИменаКолонок - Строка - имена колонок через запятую; отсутствующие в таблице пропускаются.
//
Процедура ПересчитатьКолонкиВОсновнуюВалюту(Таблица, Курс, ИменаКолонок) Экспорт
	Если Курс = 1 Тогда
		Возврат;
	КонецЕсли;
	Колонки = Новый Массив;
	Для Каждого ИмяКолонки Из СтрРазделить(ИменаКолонок, ", ", Ложь) Цикл
		Если Таблица.Колонки.Найти(ИмяКолонки) <> Неопределено Тогда
			Колонки.Добавить(ИмяКолонки);
		КонецЕсли;
	КонецЦикла;
	Для Каждого Стр Из Таблица Цикл
		Для Каждого ИмяКолонки Из Колонки Цикл
			Стр[ИмяКолонки] = РаботаСВалютамиКлиентСервер.СуммаРегл(Стр[ИмяКолонки], Курс);
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры

// Отказ документу, который ведётся только в основной валюте, по основаниям в валюте: возврат от покупателя
// и налоговая накладная берут суммы реализации как основные (валютный возврат - вне текущей волны).
//
// Параметры:
//  Основания - Массив - ссылки на документы-основания.
//  Отказ - Булево - устанавливается при валютном основании.
//
Процедура ПроверитьОснованияВОсновнойВалюте(Основания, Отказ) Экспорт
	Для Каждого Основание Из Основания Цикл
		Если Не ВалютаИКурсОбъекта(Основание).ВВалюте Тогда
			Продолжить;
		КонецЕсли;
		Шаблон = НСтр(
			"ru = 'Документ «%1» оформлен в валюте: возврат и налоговая накладная по документам в валюте не поддерживаются.';
			|fr = 'Le document « %1 » est en devise : le retour et la facture fiscale sur des documents en devise ne sont pas pris en charge.';
			|en = 'Document ""%1"" is in a foreign currency: returns and tax invoices for foreign-currency documents are not supported.';
			|es = 'El documento «%1» está en moneda extranjera: la devolución y la factura fiscal de documentos en moneda no se admiten.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон(Шаблон, Основание), , , , Отказ);
	КонецЦикла;
КонецПроцедуры

// Текст сообщения о незаданном курсе валюты.
//
// Параметры:
//  Валюта - СправочникСсылка.Валюты - валюта без курса.
//  Дата - Дата - дата, на которую курс искали.
//
// Возвращаемое значение:
//  Строка - текст для пользователя.
//
Функция ТекстКурсНеЗадан(Валюта, Дата) Экспорт
	Шаблон = НСтр("ru = 'Курс валюты %1 на %2 не задан (Казначейство - Курсы валют): цена не пересчитана.';
		|fr = 'Le taux de change de %1 au %2 n''est pas défini (Trésorerie - Taux de change) : prix non converti.';
		|en = 'The %1 exchange rate on %2 is not set (Treasury - Exchange rates): the price was not converted.';
		|es = 'El tipo de cambio de %1 al %2 no está definido (Tesorería - Tipos de cambio): precio no convertido.'");
	Возврат СтрШаблон(Шаблон, Валюта, Формат(Дата, "ДЛФ=D"));
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ВалютаИКурсПоРеквизитам(Валюта, Курс, ВВалюте)
	Основная = ОсновнаяВалюта();
	Результат = Новый Структура("Валюта, Курс, ВВалюте", Основная, 1, Ложь);
	Если ВВалюте = Ложь Или Не ЗначениеЗаполнено(Валюта) Или Валюта = Основная Тогда
		Возврат Результат;
	КонецЕсли;
	Результат.Валюта = Валюта;
	Результат.Курс = ?(Курс > 0, Курс, 1);
	Результат.ВВалюте = Истина;
	Возврат Результат;
КонецФункции

#КонецОбласти
